# 教育机构：马士兵教育
# 讲师：杨淑娟
# 开发时间：2022/4/11 19:07
#循环结构：反复做同一件事情的情况，称为循环
#选择结构的if和循环结构while的区别：if是判断一次，条件为True执行一行，while是判断n+1次，条件为True执行N次

a = 1
#判断条件表达式
while a<10:
    #执行条件执行体
    print(a)
    a+=1

#while循环的执行流程:1.初始化变量2.条件判断3.条件执行体4.改变变量
#总结：初始化的变量与条件判断的变量与改变的变量为同一个
"""计算0到4之间的累加和"""
sum = 0 #用于存储累加
#初始化变量为0
a = 0
#条件判断
while a<5:
    """条件执行体（循环体）"""
    sum += a
    """改变变量"""
    a+=1
print("和为",sum)


'''计算1到100之间的偶数和'''
i = 1
sum =0
while i<=100:
    if i%2==0:
        sum+=i
    i +=1
print('1-100之间的偶数和',sum)

'''计算1到100之间的偶数和'''
i = 1
sum =0
while i<=100:
    if not i%2:
        sum+=i
    i +=1
print('1-100之间的偶数和',sum)

'''计算1到100之间的奇数和'''
i = 1
sum =0
while i<=100:
    if i%2:   #print(bool(0))  ----->False
        sum+=i
    i +=1
print('1-100之间的奇数和',sum)



