# 教育机构：马士兵教育
# 讲师：杨淑娟
# 开发时间：2022/4/17 20:46
#格式化字符串
#(1) % 占位符
name = '张三'
age = 20
print('我叫%s,今年%d岁'%(name,age))

#(2)  {}作为占位符
print('我叫{0},今年{1}岁'.format(name,age))

#(3)  f-string
print(f'我叫{name},今年{age}岁')

print('%10d' % 99)     #10表示的是宽度
print('hellohello')
print('%f'%3.1415926)
print('%.3f'%3.1415926)    #.3表示的是小数点后三位
#同时表示宽度和精度
print('%10.3f'%3.1415926)   #总宽度为10，小数点后3位

print('{0}'.format(3.1415926))
print('{0:.3}'.format(3.1415926))     #.3表示一共是3位数
print('{0:.3f}'.format(3.1415926))    #.3f表示是3位小数
print('{0:10.3f}'.format(3.1415926))    #同时设置宽度和精度，一共是10位，3位是小数
